docs: Update blog post ascii art images to mermaid format
